soft-project/app/controllers/application_controller.rb

SELECT "manipulators".* FROM "manipulators" WHERE "manipulators"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
---
    def current_manipulatorid
        @current_manipulatorid ||= Manipulator.find(session[:current_manipulatorid]) if session[:current_manipulatorid]