soft-project/app/controllers/manipulators_controller.rb

  def index
    @manipulators = Manipulator.all
---
SELECT "manipulators".* FROM "manipulators"

  def do_register
    str = ""
    if params[:名称] == ""
      str += "名称未填写!\r\n"
    end
    if params[:密码] == ""
      str += "密码未填写!\r\n"
    end
    if params[:密码].length < 8 and params[:密码].length != 0
      str += "密码少于8个字符!\r\n"
    end
    if params[:性别] == nil
      str += "性别未填写!\r\n"
    end
    manipulator = Manipulator.where("名称": params[:名称]).first
    if params[:名称] != "" and manipulator
      str += "名称重复!\r\n"
    end

    if str == ""
      @manipulator = Manipulator.new({"名称": params[:名称], "密码": params[:密码], "类型": params[:类型], "性别": params[:性别]})
      @picture = Picture.new({"图片": "default.jpg"})
      @manipulator.头像 = @picture

      if @manipulator.save
---
SELECT "manipulators".* FROM "manipulators" WHERE "manipulators"."名称" = ? ORDER BY "manipulators"."id" ASC LIMIT ?  [["名称", ""], ["LIMIT", 1]]
INSERT INTO "manipulators" ("名称", "密码", "类型", "性别", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["名称", "abc"], ["密码", "aaaaaaaa"], ["类型", "用户"], ["性别", "女"], ["created_at", "2023-04-20 04:47:43.268536"], ["updated_at", "2023-04-20 04:47:43.268536"]]
INSERT INTO "pictures" ("图片", "manipulator_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["图片", "default.jpg"], ["manipulator_id", 2], ["created_at", "2023-04-20 04:47:43.279807"], ["updated_at", "2023-04-20 04:47:43.279807"]]

  def do_login
    str = ""
    if params[:名称] == ""
      str += "名称未填写!\r\n"
    end
    if params[:密码] == ""
      str += "密码未填写!\r\n"
    end
    if params[:密码].length < 8 and params[:密码].length != 0
      str += "密码少于8个字符!\r\n"
    end

    if str == ""
      manipulator = Manipulator.where("名称": params[:名称], "密码": params[:密码]).first
---
SELECT "manipulators".* FROM "manipulators" WHERE "manipulators"."名称" = ? AND "manipulators"."密码" = ? ORDER BY "manipulators"."id" ASC LIMIT ?  [["名称", "acaca"], ["密码", "sacccacacas"], ["LIMIT", 1]]

    def set_manipulator
      @manipulator = Manipulator.find(params[:id])
---
SELECT "manipulators".* FROM "manipulators" WHERE "manipulators"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]