app/controllers/song_types_controller.rb

  def index
    @collect_sort = params[:收藏数] if params[:收藏数].present?
    @created_sort = params[:发布时间] if params[:发布时间].present?

    if @collect_sort.present? && @created_sort.present?
      order_sql = "song_types.id, collect_count #{@collect_sort}, song_created #{@created_sort}"
    elsif @collect_sort.present?
      order_sql = "song_types.id, collect_count #{@collect_sort}"
    elsif @created_sort.present?
      order_sql = "song_types.id, song_created #{@created_sort}"
    else
      order_sql = "song_types.id"
    end

    if params[:song_type_ids].present?
      @song_type_ids = params[:song_type_ids]

      song_records = Song.left_joins(:collects)
      .select("songs.id AS song_id, songs.created_at AS song_created, COUNT(collects.id) AS collect_count")
      .group("songs.id")
      .to_sql

      song_type_records = SongType.left_joins(:relationships)
      .joins("LEFT JOIN (#{song_records}) AS song_collects ON relationships.song_id = song_collects.song_id")
      .select("song_types.id, song_types.名称, song_collects.*")
      .where("song_types.id IN (?)", @song_type_ids)    # 替换为要查询的SongType的ID数组
      .order(order_sql)

      @song_types = []
      song_type = nil
      song_type_records.each do |record|
---
SELECT "song_types".* FROM "song_types" WHERE "song_types"."名称" = ? ORDER BY "song_types"."id" ASC LIMIT ?  [["名称", "bb"], ["LIMIT", 1]]

          song_type.songs = []
          if record.song_id
            song = Song.find(record.song_id)
            song_type.songs << song
---
INSERT INTO "song_types" ("名称", "created_at", "updated_at") VALUES (?, ?, ?)  [["名称", "acacac"], ["created_at", "2023-04-20 17:04:07.475787"], ["updated_at", "2023-04-20 17:04:07.475787"]]

  def create
    if song_type_params[:名称].length > 0 and song_type_params[:名称].length <= 20
      name = SongType.where("名称": song_type_params[:名称]).first
      if name
        render json: {"信息": "名称重复！"}
      else
        @song_type = SongType.new(song_type_params)
        respond_to do |format|
          if @song_type.save
---
SELECT "song_types".* FROM "song_types" WHERE "song_types"."名称" = ? ORDER BY "song_types"."id" ASC LIMIT ?  [["名称", "bb"], ["LIMIT", 1]]
INSERT INTO "song_types" ("名称", "created_at", "updated_at") VALUES (?, ?, ?)  [["名称", ""], ["created_at", "2023-04-20 14:17:06.218466"], ["updated_at", "2023-04-20 14:17:06.218466"]]

  def destroy
    id = "song_type_" + @song_type.id.to_s
    @song_type.destroy
---
DELETE FROM "song_types" WHERE "song_types"."id" = ?  [["id", 1]]

    def set_song_type
      @song_type = SongType.find(params[:id])
---
SELECT "song_types".* FROM "song_types" WHERE "song_types"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]